import {
	Box,
	Heading,
	Text,
	ListItem,
	OrderedList,
	Button,
	useColorModeValue,
} from "@chakra-ui/react";

import { Link as RouterLink } from "react-router-dom";

export default function TermsAndConditions(): JSX.Element {
	return (
		<Box minH={"100vh"} p={6} bg={useColorModeValue("gray.50", "gray.800")}>
			<Heading as="h1" mb={4}>
				Добре дошли на страницата с общи условия за използване на нашата
				платформа Connectify
			</Heading>
			<Text mb={4}>
				Моля, прочетете внимателно следната информация, преди да
				използвате нашата платформа:
			</Text>
			<OrderedList mb={4}>
				<ListItem>
					<Text>
						Приемане на условията: Използването на нашата платформа
						Connectify подлежи на приемането на настоящите общи
						условия. Чрез достъпване и използване на нашата
						платформа, вие се съгласявате с тези условия.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Предназначение на услугата: Connectify предоставя услуги
						за свързване на емигрантските деца със събития и
						организации в тяхната нова среда. Нашата цел е да
						създадем връзки и възможности за успешна интеграция на
						децата.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Отговорност на потребителя: Като потребител на
						Connectify, вие носите пълната отговорност за всяко
						използване на нашата платформа. Необходимо е да спазвате
						всички приложими закони и правила при комуникация и
						участие в събития. Забранено е използването на лош език
						или проява на нетърпимост срещу бежанци или емигранти.
						Всяко нарушение ще доведе до незабавно прекратяване на
						достъпа до нашата платформа.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Информация за потребителите: За да използвате нашата
						платформа, може да бъде изисквано да предоставите лична
						информация. Ние ще гарантираме сигурността и защитата на
						вашите данни в съответствие с нашата Политика за
						поверителност.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Интелектуална собственост: Всички права върху
						съдържанието, предоставено от Connectify, включително
						текстове, графики, лога и други материали, са запазени.
						Забранено е копирането, модифицирането или
						разпространението на такова съдържание без наше
						разрешение.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Забрана за разпространение на снимки: По време на
						събитията, организирани чрез Connectify, е строго
						забранено разпространяването на снимки или други видове
						материали без съгласието на всички заснети лица.
						Потребителите трябва да спазват личното пространство и
						поверителността на другите участници и да не нарушават
						техните права.
					</Text>
				</ListItem>
				<ListItem>
					<Text>
						Прекратяване на достъпа: Connectify има правото да
						прекрати достъпа ви до платформата по свое усмотрение,
						ако се установи нарушение на настоящите общи условия или
						наше правило.
					</Text>
				</ListItem>
			</OrderedList>

			<Text mb={4}>
				Моля, обърнете внимание, че настоящите общи условия могат да
				бъдат променяни. Продължавайки да използвате Connectify след
				такива промени, вие се съгласявате с актуалните общи условия.
				Ако имате въпроси относно общите условия или използването на
				нашата платформа, моля, свържете се с нас чрез контактната форма
				или имейл, посочени в нашия уебсайт.
			</Text>

			<Text mb={4}>Благодарим ви, че избрахте Connectify!</Text>

			<Button
				colorScheme="blue"
				as={RouterLink}
				to="/"
				mb={4}
				mt={4}
				size="lg"
			>
				Върнете се на началната страница
			</Button>
		</Box>
	);
}
